/*
Напишите метод longestSortedSequence, который возвращает длину самой длинной отсортированной последовательности в списке целых чисел. Например, если переменная с именем list хранит следующую последовательность значений:
[1, 3, 5, 2, 9, 7, -3, 0, 42, 308, 17]
тогда вызов: list.longestSortedSequence () вернет значение 4, поскольку это длина самой длинной отсортированной последовательности в этом списке (последовательность -3, 0, 42, 308). Если список пуст, ваш метод должен вернуть 0. Обратите внимание, что для непустого списка метод всегда будет возвращать значение по крайней мере 1, потому что любой отдельный элемент составляет отсортированную последовательность.
public class ArrayIntList {
  private int[] elementData;
  private int size;
  
  // your code goes here
}
*/
